Tekla.Structures.Model.UI.Mesh
The Mesh class represents a mesh for drawing three-dimensional data.
using Tekla.Structures.Model.UI;
using Tekla.Structures.Geometry3d;
using System;
public class ConeMesh
{
private Mesh _mesh;
public Mesh Mesh
{
get { return _mesh; }
}
public ConeMesh(Point center, double height, double radius, int segmentCount)
{
_mesh = new Mesh();
Point centerTop = new Point(center);
centerTop.Z = centerTop.Z + height;
_mesh.Points.Add(centerTop);
double x = center.X + radius * Math.Cos(0.0);
double y = center.Y + radius * Math.Sin(0.0);
double z = center.Z;
Point p = new Point(x, y, z);
_mesh.AddPoint(p);
_mesh.AddLine(0, 1);
for (int i = 1; i < segmentCount; i++)
{
x = center.X + radius * Math.Cos(i * (2 * Math.PI) / segmentCount);
y = center.Y + radius * Math.Sin(i * (2 * Math.PI) / segmentCount);
z = center.Z;
p = new Point(x, y, z);
_mesh.AddPoint(p);
_mesh.AddTriangle(0, i, i + 1);
_mesh.AddLine(0, i + 1);
_mesh.AddLine(i, i + 1);
}
_mesh.AddTriangle(0, segmentCount, 1);
_mesh.AddLine(segmentCount, 1);
}
}
public class Example
{
public void Example1()
{
GraphicsDrawer drawer = new GraphicsDrawer();
ConeMesh cone = new ConeMesh(new Point(0.0, 0.0, 0.0), 5000.0, 5000.0, 100);
drawer.DrawMeshSurface(cone.Mesh, new Color(1.0, 0.0, 0.0, 1.0));
drawer.DrawMeshLines(cone.Mesh, new Color(0.0, 0.0, 1.0));
}
}

Tekla.Structures.Model.UI.Mesh.Points
An array list of point objects representing the mesh points.

Tekla.Structures.Model.UI.Mesh.Triangles
An array list of indices (as integers) pointing to the points array list. Three consecutive indices
always represent a single triangle.

Tekla.Structures.Model.UI.Mesh.Lines
An array list of indices (as integers) pointing to the points array list. Two consecutive indices
always represent a single line.

Tekla.Structures.Model.UI.Mesh.#ctor
Creates a new empty mesh instance.

Tekla.Structures.Model.UI.Mesh.#ctor(System.Collections.ArrayList,System.Collections.ArrayList,System.Collections.ArrayList)
Creates a new mesh instance with the given points, triangles and lines. Does not check
the indices in the given triangles and lines array lists for correctness.
Points: An array list of point objects representing the mesh points. Null represents
no points.
Triangles: An array list of indices (of type integer) pointing to the points array list.
Three consecutive indices represent a single triangle. The first index is 0. If null, the mesh
will not contain any triangles.
Lines: An array list of indices (of type integer) pointing to the points array list.
Two consecutive indices represent a single line. The first index is 0. If null, the mesh
will not contain any lines.

Tekla.Structures.Model.UI.Mesh.AddPoint(Tekla.Structures.Geometry3d.Point)
Adds a new point in the mesh.
Point: The point to be added, must not be null.
Returns: The index of the added point.

Tekla.Structures.Model.UI.Mesh.AddTriangle(System.Int32,System.Int32,System.Int32)
Adds a new triangle in the mesh.
Index1: The index of the triangle's first point in the points array list.
Index2: The index of the triangle's second point in the points array list.
Index3: The index of the triangle's third point in the points array list.

Tekla.Structures.Model.UI.Mesh.AddLine(System.Int32,System.Int32)
Adds a new line in the mesh.
Index1: The index of the line's start point in the points array list.
Index2: The index of the line's end point in the points array list.